dtbao-embedded-dev/app-updater/workspace/0xF001/sdkconfig.defaults
# R-BLD-05: every build knob is versioned here, never in a developer
# environment. A build that only works on one laptop is not a build.

CONFIG_IDF_TARGET="esp32s3"

# 4 MB flash. Change this and partitions.csv in the same commit.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Two OTA slots, no factory partition - see partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# R-VER-08: a freshly flashed image gets exactly one boot to confirm itself,
# otherwise the bootloader reverts to the previous one. The confirmation lives
# in application/app/src/app.c (confirm_or_roll_back).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# R-BLD-03: asserts stay enabled in Release. A field unit that hits a broken
# invariant should stop and reboot into a known state, not run on with corrupt
# data. -Os keeps the two OTA slots affordable.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

# R-LOG-06: the maximum level is a compile-time filter, so anything above it
# costs no flash and evaluates no arguments. Default level is what ships.
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
